
#Region Variables

Var ExtensionData;

Var PlatformData;
Var Compatibility;

#EndRegion

#Region FormEventHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	УстановкаВозможна = IsExtensionInstallationPossible(ОписаниеОшибки);
	
	EnsureExtensionDataLoaded();
	ManageForm(ThisForm);
	
EndProcedure

&AtClient
Procedure OnOpen(Cancel)
	
	If УстановкаВозможна Then
		If IsSyncMethodUsageRestricted() Then
			Items.СтраницыГлавнаяПанель.CurrentPage = Items.СтраницаЗапускНовогоСеанса;
			ПодключитьОбработчикОжидания("StartThickClientSession", 2000);
		EndIf;
	EndIf;
	
EndProcedure

#EndRegion

#Region FormHeaderItemsEventHandlers

&AtClient
Procedure CancelSessionLaunch(Item, FormattedStringURL, StandardProcessing)
	
	ОтключитьОбработчикОжидания("StartThickClientSession");
	Items.ДекорацияЗапускНовогоСеансаОтменен.Visible = True;
	Items.ДекорацияЗапускНовогоСеанса       .Visible = False;
	
EndProcedure

&AtClient
Procedure RestartSessionLaunch(Item, FormattedStringURL, StandardProcessing)
	
	Items.ДекорацияЗапускНовогоСеансаОтменен.Visible = False;
	Items.ДекорацияЗапускНовогоСеанса       .Visible = True;
	ПодключитьОбработчикОжидания("StartThickClientSession", 100);
	
EndProcedure

#EndRegion

#Region FormCommandsEventHandlers

&AtClient
Procedure InstallExtension(Command)
	
	BinaryData = Undefined;
	If ЗначениеЗаполнено(ФайлРасширения) Then
		BinaryData = Новый ДвоичныеДанные(ФайлРасширения);
	Else
		BinaryData = DownloadExtensionFileFromServer();
	EndIf;
	
	InstallExtensionAtServer(BinaryData);
	
EndProcedure

&AtClient
Procedure DeleteExtension(Command)
	
	DeleteExtensionAtServer();
	
EndProcedure

#EndRegion

#Region Private

#Region FormState

&AtClientAtServerNoContext
Procedure ManageForm(Form)
	
	Items           = Form.Items;
	InstallerParams = Form.ПараметрыУстановщика;
	
	Form.AutoTitle = False;
	Form.Title     = InstallerParams.Представление;
	
	If Not Form.УстановкаВозможна Then
		Items.СтраницыГлавнаяПанель.CurrentPage           = Items.СтраницаУстановкаНеПоддерживается;
		Items[Form.ОписаниеОшибки.ИмяГруппыФормы].Visible = True;
	EndIf;
	
	If ExtensionData <> Undefined Then
		If ExtensionData.Active Then
			Items.ГруппаСостояние.Visible = True;
			Form.СостояниеРасширения       = ActiveExtensionStateCaption();
		ElsIf ExtensionData.Installed Then
			Items.ГруппаСостояние.Visible = True;
			Form.СостояниеРасширения       = InactiveExtensionStateCaption();
		EndIf;
		
		If ExtensionData.Active Or ExtensionData.Installed Then
			Form.ВерсияРасширения = ExtensionVersionCaption(ExtensionData.Version);
		EndIf;
	EndIf;
	
	Form.ВерсияУстановщика = InstallerParams.Версия;
	
EndProcedure

&AtClientAtServerNoContext
Function ExtensionVersionCaption(CurrentVersion, NewVersion = Undefined)
	
	CaptionParts = Новый Массив();
	CaptionParts.Добавить("Текущая версия:");
	CaptionParts.Добавить(" ");
	CaptionParts.Добавить(
		Новый ФорматированнаяСтрока(
			CurrentVersion,
			Новый Шрифт("",12),
			?(NewVersion = Undefined, ЦветаСтиля.ЦветАкцента, ЦветаСтиля.ЦветОсобогоТекста)
		)
	);
	If NewVersion <> Undefined Then
		CaptionParts.Добавить(" ");
		CaptionParts.Добавить(БиблиотекаКартинок.СтрелкаВправо);
		CaptionParts.Добавить(" ");
		CaptionParts.Добавить(
			Новый ФорматированнаяСтрока(
				CurrentVersion,
				Новый Шрифт("",12),
				ЦветаСтиля.ЦветАкцента
			)
		);
		CaptionParts.Добавить(" ");
		CaptionParts.Добавить(
			Новый ФорматированнаяСтрока(
				"обновить",
				Новый Шрифт("",12),
				ЦветаСтиля.ГиперссылкаЦвет,
				,
				"обновить"
			)
		);
	EndIf;

	Return Новый ФорматированнаяСтрока(CaptionParts);
	
EndFunction

&AtClientAtServerNoContext
Function ActiveExtensionStateCaption()

	Return Новый ФорматированнаяСтрока(
		"Расширение установлено и активно", Новый Шрифт("",12), ЦветаСтиля.ЦветАкцента);

EndFunction

&AtClientAtServerNoContext
Function InactiveExtensionStateCaption()

	CaptionParts = Новый Массив();
	CaptionParts.Добавить(Новый ФорматированнаяСтрока(
		"Расширение установлено ", Новый Шрифт("",12), ЦветаСтиля.ЦветАкцента));
	CaptionParts.Добавить(Новый ФорматированнаяСтрока(
		"(не активно)",, ЦветаСтиля.ЦветОсобогоТекста));

	Return Новый ФорматированнаяСтрока(CaptionParts);

EndFunction

#EndRegion

Функция УстановкаРасширенияВозможна(ОписаниеОшибки)
	
	ОписаниеОшибки = Новый Структура();     
	ОписаниеОшибки.Вставить("ТипОшибки");
	ОписаниеОшибки.Вставить("ИмяГруппыФормы");
	
	#Если ВебКлиент Тогда     
		ОписаниеОшибки.ТипОшибки      = "УстановкаВВебКлиенте"; 
		ОписаниеОшибки.ИмяГруппыФормы = "ГруппаУстановкаВВебКлиенте";
		Возврат Ложь;
	#КонецЕсли 
	
	Если ВерсияПлатформыНиже(Совместимость.МинимальнаяВерсияПлатформы) Тогда
		ОписаниеОшибки.ТипОшибки      = "МинимальнаяВерсияПлатформы";
		ОписаниеОшибки.ИмяГруппыФормы = "ГруппаМинимальнаяВерсияПлатформы";
		Возврат Ложь;
		Сообщить("Необходима версия платформы 8.3.10 или выше");
	КонецЕсли;     
	
	Если ВерсияРежимаСовместимостиНиже(Совместимость.МинВерсияРежимаСовместимости) Тогда
		ОписаниеОшибки.ТипОшибки      = "МинВерсияРежимаСовместимости";
		ОписаниеОшибки.ИмяГруппыФормы = "ГруппаМинВерсияРежимаСовместимости";
		Возврат Ложь;
		Сообщить("Необходим режим совместимости конфигурации 8.3.9 или выше");
	КонецЕсли;   
	
	ЗагрузитьДанныеУстановленногоРасширения();
	
	Если МодульВстроенВКонфигурацию() Тогда
		ОписаниеОшибки.ТипОшибки      = "МодульВстроенВКонфигурацию";
		ОписаниеОшибки.ИмяГруппыФормы = "ГруппаМодульВстроенВКонфигурацию";
		Возврат Ложь;
		Сообщить("В конфигурации встроена подсистема ""Инструменты разработчика"". Установка расширения невозможна.");
	КонецЕсли;   
	
	Возврат Истина
	
КонецФункции

Функция СтоитЗапретИспользованияСинхронныхМетодов() 
	
	Файл = Новый Файл("");   
	
	Попытка
		ФайлСуществует = Файл.Существует();
	Исключение   
		Возврат Истина;
	КонецПопытки;     
	
	Возврат Ложь;     
	
КонецФункции

&НаКлиенте
Функция ЗапуститьСеансТолстогоКлиента()
	
	#Если Не ВебКлиент Тогда
		КлючиПараметров = Новый Массив();
		КлючиПараметров.Добавить("ENTERPRISE /IBConnectionString");
		КлючиПараметров.Добавить("""" + СтрЗаменить(СтрокаСоединенияИнформационнойБазы(), """", """""") + """");        
		КлючиПараметров.Добавить("/RunModeManagedApplication");
		КлючиПараметров.Добавить("/DEBUG");
		КлючиПараметров.Добавить("/Execute");
		КлючиПараметров.Добавить("""" + ПараметрыУстановщика.ИмяТекущегоФайла + """");
		ПараметрыЗапуска = РежимСовместимости_СтрСоединить(КлючиПараметров, " ");
		НачатьЗапускПриложения(
			Новый ОписаниеОповещения, 
			"""" + ИмяИсполняемогоФайлаПлатформы() + """ "
			+ ПараметрыЗапуска
		);
	#КонецЕсли
	
	Закрыть();
	
КонецФункции

#Область Расширение

&НаСервере
Процедура ЗагрузитьДанныеУстановленногоРасширения(ТекущееРасширение = Неопределено)
	
	ДанныеРасширения = Новый Структура();
	ДанныеРасширения.Вставить("Установлено", Ложь        );
	ДанныеРасширения.Вставить("Активно"    , Ложь        );
	ДанныеРасширения.Вставить("Версия"     , ""          );
	ДанныеРасширения.Вставить("Расширение" , Неопределено);
	
	// Антибаг платформы https://partners.v8.1c.ru/forum/t/1607016/m/1607016
	Если ЭтоВерсияПлатформы(803010, 803050, 2265) Тогда 
		Возврат;	
	КонецЕсли;
	
	Расширение = ТекущееРасширение;
	Если ТекущееРасширение = Неопределено Тогда
		Отбор = Новый Структура();   
		Отбор.Вставить("Имя", ПараметрыУстановщика.ИмяРасширения);
		НайденныеСтроки = Вычислить("РасширенияКонфигурации").Получить(Отбор);
		Если НайденныеСтроки.Количество() = 0 Тогда
			Возврат;
		КонецЕсли; 
		
		Расширение = НайденныеСтроки[0];
	КонецЕсли;
	
	ДанныеРасширения.Установлено = Истина;
	ДанныеРасширения.Активно     = Расширение.Активно;
	ДанныеРасширения.Версия      = Расширение.Версия;
	
	ДанныеРасширения.Расширение  = Расширение; 
		
КонецПроцедуры

&НаСервере
Процедура УстановитьРасширениеНаСервере(ДвоичныеДанныеРасширения)
	
	ВнешОбработка = РеквизитФормыВЗначение("Объект");
	ДвоичныеДанныеРасширения = ВнешОбработка.ПолучитьМакет("MoleculerOneS");
	
	Если ДанныеРасширения = Неопределено Тогда
		ЗагрузитьДанныеУстановленногоРасширения()	
	КонецЕсли;
	
	Если ДанныеРасширения.Расширение = Неопределено Тогда
		ДанныеРасширения.Расширение = РасширенияКонфигурации.Создать();
	КонецЕсли;
	
	УстановитьСвойстваРасширения(ДанныеРасширения.Расширение);
	
	ДанныеРасширения.Расширение.Записать(ДвоичныеДанныеРасширения);
	
	// Антибаг режима совместимости 8.3.10. В нем флаг ПредупреждатьОбОпасныхДействиях с первого раза не устанавливается https://www.hostedredmine.com/issues/925886
	Если ЭтоВерсияПлатформы(, 80310) Тогда
		Если ДанныеРасширения.Расширение.ЗащитаОтОпасныхДействий.ПредупреждатьОбОпасныхДействиях Тогда
			ДанныеРасширения.Расширение.ЗащитаОтОпасныхДействий.ПредупреждатьОбОпасныхДействиях = Ложь;
			ДанныеРасширения.Расширение.Записать();
		КонецЕсли; 
	КонецЕсли;
	
	ЗагрузитьДанныеУстановленногоРасширения(ДанныеРасширения.Расширение);
	НастроитьФорму();
	
	ДобавитьТекущемуПользователюПраваНастройкиРасширения();
	
КонецПроцедуры 

&НаСервере
Процедура УдалитьРасширениеНаСервере()

	Если ДанныеРасширения = Неопределено Тогда
		ЗагрузитьДанныеУстановленногоРасширения()	
	КонецЕсли;
	
	Если ДанныеРасширения.Установлено Тогда
		ДанныеРасширения.Расширение.Удалить(); 
		ЗагрузитьДанныеУстановленногоРасширения();
		НастроитьФорму();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвойстваРасширения(Знач ТекущееРасширение)
	
	#Если Сервер И Не Сервер Тогда
		ТекущееРасширение = РасширенияКонфигурации.Создать();
	#КонецЕсли
	Если ВерсияПлатформыВыше(80312) Тогда
		ТекущееРасширение.Активно = Истина;
	КонецЕсли;
	
	Если ВерсияПлатформыВыше(80315) Тогда
		ТекущееРасширение.ИспользоватьОсновныеРолиДляВсехПользователей = Ложь;
	КонецЕсли;
	 
	ТекущееРасширение.БезопасныйРежим = Ложь;
	ТекущееРасширение.ЗащитаОтОпасныхДействий.ПредупреждатьОбОпасныхДействиях = Ложь;

КонецПроцедуры

&НаСервере
Процедура ДобавитьТекущемуПользователюПраваНастройкиРасширения()
	
КонецПроцедуры

&НаСервере
Функция МодульВстроенВКонфигурацию()
	
	Если ДанныеРасширения = Неопределено Тогда
		ЗагрузитьДанныеУстановленногоРасширения()	
	КонецЕсли;
	
	Возврат ДанныеРасширения.Установлено = Истина И Метаданные.Обработки.Найти("Moleculer") <> Неопределено;
		
КонецФУнкции

Функция СкачатьФайлРасширенияССервера()
		
	Возврат Неопределено;// Новый ДвоичныеДанные("C:\development\moleculer-1c\build\1Cv8.cfe");
	
КонецФункции

#КонецОбласти

#Область ДанныеПлатформы

Функция ЭтоВерсияПлатформы(НомерВерсии = Неопределено, НомерРежимаСовместимости = Неопределено, НомерСборки = Неопределено)
	
	Если ДанныеПлатформы = Неопределено Тогда
		УстановитьДанныеВерсииПлатформы();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НомерВерсии) 
		И Не ДанныеПлатформы.ВерсияПлатформы = НомерВерсии Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НомерРежимаСовместимости) 
		И Не ДанныеПлатформы.РежимСовместимости = НомерРежимаСовместимости Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НомерСборки) 
		И Не ДанныеПлатформы.НомерСборки = НомерСборки Тогда
		Возврат Ложь;
	КонецЕсли;  
	
	Возврат Истина;
	
Конецфункции

Функция ВерсияПлатформыНиже(ЗначениеВерсииПлатформы)

	Если ДанныеПлатформы = Неопределено Тогда
		УстановитьДанныеВерсииПлатформы();
	КонецЕсли;
	
	Возврат ДанныеПлатформы.ВерсияПлатформы < ЗначениеВерсииПлатформы;
	
КонецФункции

Функция ВерсияПлатформыВыше(ЗначениеВерсииПлатформы)

	Если ДанныеПлатформы = Неопределено Тогда
		УстановитьДанныеВерсииПлатформы();
	КонецЕсли;
	
	Возврат ДанныеПлатформы.ВерсияПлатформы > ЗначениеВерсииПлатформы;
	
КонецФункции

Функция ВерсияРежимаСовместимостиНиже(ЗначениеВерсииРежимаСовместимости)

	Если ДанныеПлатформы = Неопределено Тогда
		УстановитьДанныеВерсииПлатформы();
	КонецЕсли;
	
	Возврат ДанныеПлатформы.РежимСовместимости < ЗначениеВерсииРежимаСовместимости;
	
КонецФункции

Функция ВерсияРежимаСовместимостиВыше(ЗначениеВерсииРежимаСовместимости)

	Если ДанныеПлатформы = Неопределено Тогда
		УстановитьДанныеВерсииПлатформы();
	КонецЕсли;
	
	Возврат ДанныеПлатформы.РежимСовместимости > ЗначениеВерсииРежимаСовместимости;
	
КонецФункции

Процедура УстановитьДанныеВерсииПлатформы()
	
	ДанныеПлатформы = Новый Структура();
	ДанныеПлатформы.Вставить("ВерсияПлатформы"   , 0);
	ДанныеПлатформы.Вставить("НомерСборки"       , 0);
	ДанныеПлатформы.Вставить("РежимСовместимости", 0);
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	ДанныеПриложения = РазобратьНомерВерсии(СистемнаяИнформация.ВерсияПриложения);	
	
	ДанныеПлатформы.ВерсияПлатформы = ДанныеПриложения.ВерсияПлатформы;
	ДанныеПлатформы.НомерСборки     = ДанныеПриложения.НомерСборки;
	
	ТекущийРежимСовместимости = Метаданные.РежимСовместимости;
	Если ТекущийРежимСовместимости = Метаданные.СвойстваОбъектов.РежимСовместимости.НеИспользовать Тогда
		ДанныеПлатформы.ВерсияРежимаСовместимости = ДанныеПлатформы.ВерсияПлатформы;
	Иначе
		СтрокаВерсии = СтрЗаменить(ТекущийРежимСовместимости, "Версия" , "");
		СтрокаВерсии = СтрЗаменить(СтрокаВерсии             , "Version", ""); 
		ДанныеРежимаСовместимости = РазобратьНомерВерсии(СтрокаВерсии, "_"); 
		ДанныеПлатформы.РежимСовместимости = ДанныеРежимаСовместимости.ВерсияПлатформы;
	КонецЕсли;
	
КонецПроцедуры

Функция РазобратьНомерВерсии(НомерВерсии, Разделитель = ".")
	
	Результат = Новый Структура();
	Результат.Вставить("ВерсияПлатформы", 0);
	Результат.Вставить("НомерСборки", 0);
	
	СтрокаВерсияПлатформы = "";
	ФрагментыВерсии = РежимСовместимости_СтрРазделить(НомерВерсии, Разделитель);
	Для Индекс = 0 По Мин(ФрагментыВерсии.ВГраница(), 2) Цикл   
		Значение = Число(ФрагментыВерсии[Индекс]);
		СтрокаВерсияПлатформы = СтрокаВерсияПлатформы + Формат(Значение, "ND=2; NLZ="); 
	КонецЦикла;  
		
	Результат.ВерсияПлатформы = Число(СтрокаВерсияПлатформы);
		
	Если ФрагментыВерсии.Количество() = 4 Тогда
		Результат.НомерСборки = Число(ФрагментыВерсии[3]);		
	КонецЕсли; 
	                
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ЭтоПлатформаWindows() Экспорт
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Возврат Ложь
		Или СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86
		Или СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86_64;

КонецФункции
	
&НаКлиенте
Функция ЭтоУчебнаяПлатформа() Экспорт 

	ВременныйФайл = ПолучитьИмяВременногоФайла("mxl");
	ТабДок = Новый ТабличныйДокумент;
	Попытка
		ТабДок.Записать(ВременныйФайл, ТипФайлаТабличногоДокумента.MXL7); // В учебной версии платформы это запрещено https://www.hostedredmine.com/issues/923942
	Исключение
		ОписаниеОшибки = ОписаниеОшибки(); 
		Если Найти(ОписаниеОшибки, "синхронных") > 0 Тогда
			// Использование синхронных методов на клиенте запрещено!
			Возврат Ложь;
		КонецЕсли;
		Возврат Истина;
	КонецПопытки; 
	УдалитьФайлы(ВременныйФайл);
	Возврат Ложь;

КонецФункции

&НаКлиенте
// Добавляет если нужно расширение ".exe"
Функция ИмяИсполняемогоФайла(Знач ИмяБезРасширения)
	Если ЭтоПлатформаWindows() Тогда
		Возврат ИмяБезРасширения + ".exe";
	КонецЕсли;
	Возврат ИмяБезРасширения;
КонецФункции

&НаКлиенте
Функция ИмяИсполняемогоФайлаПлатформы(Полное = Истина, Тонкий = Ложь) Экспорт 
	Результат = "1cv8";
	Если Тонкий Тогда
		Результат = Результат + "c";
	КонецЕсли; 
	Если ЭтоУчебнаяПлатформа() Тогда
		Результат = Результат + "t";
	КонецЕсли; 
	Результат = ИмяИсполняемогоФайла(Результат);
	Если Полное Тогда
		Результат = КаталогПрограммы() + Результат;
	КонецЕсли; 
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область БазовыеПараметры

Функция НовыйПараметрыУстановщика()
	
	Результат = Новый Структура(); 
	Результат.Вставить("Представление"   , "");
	Результат.Вставить("ИмяРасширения"   , "");
	Результат.Вставить("ОсновнойМодуль"  , "");
	Результат.Вставить("Версия"          , "");
	Результат.Вставить("АдресРасширения" , "");
	Результат.Вставить("ИмяТекущегоФайла", "");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область РежимСовместимости 

Функция ИнициализироватьПараметрыРежимаСовместимости()

	Совместимость = Новый Структура();
	Совместимость.Вставить("СтрРазделить", 80306); 
	Совместимость.Вставить("СтрСоединить", 80306); 
	
	Совместимость.Вставить("МинимальнаяВерсияПлатформы"  , 80310);
	Совместимость.Вставить("МинВерсияРежимаСовместимости", 80309);
	
КонецФункции

Функция РежимСовместимости_СтрРазделить(Строка, Разделитель, ВключатьПустые = Истина)

	Если ВерсияПлатформыНиже(Совместимость.СтрРазделить) Тогда
		МассивЧастей = Новый Массив();
		ЧастиСтроки = СтрЗаменить(Строка, Разделитель, Символы.ПС);
		Для НомерСтроки = 1 По СтрЧислоСтрок(ЧастиСтроки) Цикл
			ЧастьСтроки = СтрПолучитьСтроку(ЧастиСтроки, НомерСтроки);
			Если ВключатьПустые = Ложь И Не ЗначениеЗаполнено(ЧастьСтроки) Тогда
				Продолжить;
			КонецЕсли;
			МассивЧастей.Добавить(ЧастьСтроки);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Вычислить("СтрРазделить(Строка, Разделитель, ВключатьПустые)");
	
КонецФункции 


Функция РежимСовместимости_СтрСоединить(Строка, Разделитель = "")

	Если ВерсияПлатформыНиже(Совместимость.СтрСоединить) И ВерсияРежимаСовместимостиНиже(Совместимость.СтрСоединить) Тогда
		ИтоговаяСтрока = "";
		Для Каждого ЧастьСтроки Из Строка Цикл
			ИтоговаяСтрока = ИтоговаяСтрока + ЧастьСтроки + Разделитель;
		КонецЦикла;     
		Если СтрДлина(Разделитель) <> 0 Тогда
			ИтоговаяСтрока = Лев(ИтоговаяСтрока, СтрДлина(ИтоговаяСтрока) - СтрДлина(Разделитель));
		КонецЕсли;
		Возврат ИтоговаяСтрока;
	КонецЕсли;
	
	Возврат Вычислить("СтрСоединить(Строка, Разделитель)");
	
КонецФункции

#EndRegion

#EndRegion

#Region Initialization

InitializeCompatibilityParams();

SetInstallerParameters();

#EndRegion

